In [1]:
#creating series from a list
import numpy as np
import pandas as pd

In [3]:
first_series = pd.Series(list('abcdef'))

In [4]:
print(first_series)

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [5]:
#creating series from an ndarray
np_country = np.array(['Luxembourg','Norway','Japan','Switzerland','United states','Qatur','iceland','swedan','singapore','denmark'])

In [6]:
s_country = pd.Series(np_country)

In [7]:
print (s_country)

0       Luxembourg
1           Norway
2            Japan
3      Switzerland
4    United states
5            Qatur
6          iceland
7           swedan
8        singapore
9          denmark
dtype: object

In [11]:
#creating Series from dict
dict_country_gdp = pd.Series([520.124,415.321,745.125],index=['lux','mac','nor'])

In [12]:
print (dict_country_gdp)

lux    520.124
mac    415.321
nor    745.125
dtype: float64

In [14]:
#creating series from scalar input
scalar_series = pd.Series(5.,index=['a','b','c','e'])

In [15]:
scalar_series

a    5.0
b    5.0
c    5.0
e    5.0
dtype: float64

In [16]:
#access element in the series
dict_country_gdp[0]

520.124

In [17]:
dict_country_gdp[0:5]

lux    520.124
mac    415.321
nor    745.125
dtype: float64

In [19]:
dict_country_gdp.loc['mac']

415.321

In [20]:
dict_country_gdp.iloc[0]

520.124

In [23]:
#vectorizing operations in series
first_vector_series = pd.Series([1,2,3,4],index=['a','b','c','d'])
second_vector_series = pd.Series([10,20,30,40],index=['a','b','c','d'])

In [24]:
first_vector_series+second_vector_series

a    11
b    22
c    33
d    44
dtype: int64

In [25]:
second_vector_series = pd.Series([10,20,30,40],index=['a','b','c','d'])

In [26]:
first_vector_series+second_vector_series

a    11
b    22
c    33
d    44
dtype: int64

In [28]:
second_vector_series = pd.Series([10,20,30,40],index=['a','b','e','f'])

In [29]:
first_vector_series+second_vector_series

a    11.0
b    22.0
c     NaN
d     NaN
e     NaN
f     NaN
dtype: float64

In [30]:
#creating data frames from list
import pandas as pd

In [31]:
olympic_data_list = {'hos':['lon','beg','ath'],'year':[2012,2008,2004],'no.of par con':[202,201,2012]}

In [32]:
df_olympic_data = pd.DataFrame(olympic_data_list)

In [33]:
df_olympic_data

   hos  year  no.of par con
0  lon  2012            202
1  beg  2008            201
2  ath  2004           2012

In [34]:
olympic_data_dict = {'london':{2012:205},'Beij':{2008:204}}

In [35]:
df_olympic_data_dict = pd.DataFrame(olympic_data_dict)

In [36]:
df_olympic_data_dict

      london   Beij
2012   205.0    NaN
2008     NaN  204.0

In [37]:
df_olympic_data.hos

0    lon
1    beg
2    ath
Name: hos, dtype: object

In [38]:
df_olympic_data.describe

<bound method NDFrame.describe of    hos  year  no.of par con
0  lon  2012            202
1  beg  2008            201
2  ath  2004           2012>

In [39]:
#create Dataframe from dict of series
olympic_series_part = pd.Series([205,202,203],index=[2012,2032,2511])
olympic_series_country = pd.Series(['london','beij','ath'],index=[2012,2032,2511])

In [41]:
df_olympic_series = pd.DataFrame([{'No. of Part coun':olympic_series_part,'host cities':olympic_series_country}])

In [42]:
df_olympic_series

,No. of Part coun,host cities
0,2012 205 2032 202 2511 203 dtype: int64,2012 london 2032 beij 2511 ath d...

In [44]:
#creating DATAFRAME from dict of ndarray
import numpy as np

In [46]:
np_array = np.array([2012,2008,2004,2006])
dict_ndarray = {'year':np_array}

In [47]:
df_ndarray = pd.DataFrame(dict_ndarray)

In [48]:
df_ndarray

   year
0  2012
1  2008
2  2004
3  2006

In [50]:
#creating dataframe from dataframe object
df_from_df = pd.DataFrame(df_olympic_series)

In [51]:
df_from_df

,No. of Part coun,host cities
0,2012 205 2032 202 2511 203 dtype: int64,2012 london 2032 beij 2511 ath d...

In [52]:
#Data operation
import pandas as pd

In [54]:
df_movie_rating = pd.DataFrame(
                {'movie 1': [5,4,3,3,2,1],
                'movie 2': [4,5,2,3,4,1]},
                 index=['Tom','jef','peter','ram','ted','paul']
)

In [55]:
df_movie_rating

       movie 1  movie 2
Tom          5        4
jef          4        5
peter        3        2
ram          3        3
ted          2        4
paul         1        1

In [56]:
#data operation with functions
def movie_grade(rating):
    if rating==5:
        return 'A'
    if rating==4:
        return 'B'
    if rating==3:
        return 'C'
    else:
        return 'F'

In [57]:
print (movie_grade(5))

A

In [59]:
df_movie_rating.applymap(movie_grade)

      movie 1 movie 2
Tom         A       B
jef         B       A
peter       C       F
ram         C       C
ted         F       B
paul        F       F

In [62]:
#data operation with statistical functions
df_test_scores = pd.DataFrame(
                {'Test1': [95,84,73,88,82,61],
                'Test2': [74,85,82,73,77,79]},
                 index=['Jack','Lewis','Pat','Rich','Kelly','Paul']
)

In [63]:
df_test_scores.max()

Test1    95
Test2    85
dtype: int64

In [64]:
df_test_scores.mean()

Test1    80.500000
Test2    78.333333
dtype: float64

In [65]:
df_test_scores.std()

Test1    11.979149
Test2     4.633213
dtype: float64

In [66]:
#data operation using groupby
df_president_name = pd.DataFrame({'first':['geo','bil','ron'], 'last':['bash','clin','rig']})

In [67]:
df_president_name

  first  last
0   geo  bash
1   bil  clin
2   ron   rig

In [68]:
grouped = df_president_name.groupby('first')

In [69]:
grp_data = grouped.get_group('geo')
grp_data

  first  last
0   geo  bash

In [70]:
df_president_name.sort_values('first')

  first  last
1   bil  clin
0   geo  bash
2   ron   rig

In [71]:
#data standardization
def standardize_tests(test):
    return(test-test.mean())/test.std()

In [78]:
standardize_tests(df_test_scores['Test1'])

Jack     1.210437
Lewis    0.292174
Pat     -0.626088
Rich     0.626088
Kelly    0.125218
Paul    -1.627829
Name: Test1, dtype: float64

In [79]:
def standartize_test_scores(datafrm):
    return datafrm.apply(standardize_tests)

In [80]:
standardize_test_scores(df_test_scores)

NameError: name 'standardize_test_scores' is not defined

In [81]:
import pandas as pd

In [82]:
import sqlite3

In [83]:
create_table = """"
CREATE TABLE student_score
(Id INTEGER, Name VARCHAR(20), Math REAL,
Science REAL
);"""

In [85]:
executeSQL = sqlite3.connect(':memory:')
executeSQL.execute(create_table)
executeSQL.commit()

OperationalError: unrecognized token: ""
CREATE TABLE student_score
(Id INTEGER, Name VARCHAR(20), Math REAL,
Science REAL
);"